/* eslint-disable no-useless-escape */

export const REG_EXP = {
    email: /^\w+([\.-]?\w+)*@\w+([\.-]?\w+)*(\.\w{2,3})+$/,
    password: /^[a-zA-Z\d!@#$%^&*=]{8,16}$/g,
    tel: /^\d{2,3}\d{3,4}\d{4}$/,
    emoji:
      /([\u2700-\u27BF]|[\uE000-\uF8FF]|\uD83C[\uDC00-\uDFFF]|\uD83D[\uDC00-\uDFFF]|[\u2011-\u26FF]|\uD83E[\uDD10-\uDDFF])/g,
    phone: /^[0-9]{2,3}[0-9]{3,4}[0-9]{4}/,
    'yyyy-mm-dd': /^(19|20)\d{2}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[0-1])$/,
    bizNumber: /^[0-9]{10}$/,
    onlyNum: /^[0-9]+$/g,
    price: /(.)(?=(\d{3})+$)/g,
    // 한글(자음, 모음 불가), 영문, 숫자, 공백, 키보드에 있는 특수문자만 입력 가능합니다
    projectName: /^[0-9가-힣a-zA-Z\\`~₩!@#$%^&*()_+-={}|;':",./<>?\[\]\s]+$/g,
    // 한글(자음, 모음 불가), 영문, 숫자, 공백, 키보드에 있는 특수문자만 입력 가능합니다
    projectAddressDetail:
      /^[0-9가-힣a-zA-Z\\`~₩!@#$%^&*()_+-={}|;':",./<>?\[\]\s]+$/g,
    // 한글(자음, 모음 불가), 영문, 숫자, 키보드에 있는 특수문자만 입력 가능합니다
    projectETC: /^[0-9가-힣a-zA-Z\\`~₩!@#$%^&*()_+-={}|;':",./<>?\[\]]+$/g,
    // 한글(자음, 모음 불가), 영문, 슷지만 입력 가능합니다
    customerName: /^[a-zA-Z\s가-힣\s0-9]+$/g,
    // 한글(자음, 모음 불가), 영문, 숫자, 특수문자만 입력 가능합니다
    allCharCompleteKor: /^[^ㄱ-ㅎㅏ-ㅣ]+$/g,
  };
  